АлогистикТест2/src/AccumulationRegisters/алк_ОборотыПроизводства/алк_ОборотыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОборотыПроизводства</name>
  <comment>старый !</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтгрузки</name>
    <type>
      <types>EnumRef.алк_ВидыОтгрузки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответхранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнутреннееПотребление</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/CommonModules/РФП_ПроведениеДокументовСервер/Module.bsl
Процедура ОтразитьПроводки_алк_ОборотыПроизводства(Регистратор) Экспорт
	ОборотыПроизводства = РегистрыНакопления.алк_ОборотыПроизводства.СоздатьНаборЗаписей();
	ОборотыПроизводства.Отбор.Регистратор.Установить(Регистратор);
	ОборотыПроизводства.Прочитать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Характеристика,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	СУММА(ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем, 0)) КАК Объем,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК Операция,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
		|ГДЕ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Характеристика,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Организация";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор); 	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОборотыПроизводства.Очистить();
	Иначе
		Возврат;
	КонецЕсли;	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = ОборотыПроизводства.Добавить();
		Движение.Период = Регистратор.Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ОборотыПроизводства.Записать();
КонецПроцедуры

Процедура РФП_ПриЗаписиДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник,Отказ,РежимЗаписи,РежимПроведения);
КонецПроцедуры

// Дубоделов Э.А 
Функция ЗаписыватьДвиженияВНовыеРегистры(ДатаДокумента) Экспорт
	
	ДатаНачалаЗаписи = Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить();
	
	Если ДатаНачалаЗаписи <> Дата("00010101") И ДатаНачалаЗаписи <= ДатаДокумента Тогда 
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция ЗаписыватьДвиженияВРегистрТоварыВПуи(ДатаДокумента) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ДополнительныеНастройкиСрезПоследних.Дата
	               |ИЗ
	               |	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаТоваровВПути"") КАК алк_ДополнительныеНастройкиСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ДатаНачалаЗаписи = Выборка.Дата; 
	КонецЦикла;
		
	Если ДатаНачалаЗаписи <> Дата("00010101") И ДатаНачалаЗаписи <= ДатаДокумента Тогда 
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции
